### ✅ All Terraform Checks Passed!

**1** directories validated successfully.

| Directory | Format | Init | Validate | Plan | Changes |
|-----------|--------|------|----------|------|----------|
| `03-workloads/portals/admin-portal-dev` | ✅ | ✅ | ✅ | ✅ | +1 to add, ~1 to change |

<details>
<summary>📋 Plan for <code>03-workloads/portals/admin-portal-dev</code></summary>

```terraform
# azurerm_linux_virtual_machine.my_linux_vm will be created
  + resource "azurerm_linux_virtual_machine" "my_linux_vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "testuser"
      + allow_extension_operations                             = (known after apply)
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = (known after apply)
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "test"
      + network_interface_ids                                  = [
          + "/subscriptions/123/resourceGroups/testrg/providers/Microsoft.Network/networkInterfaces/testnic",
        ]
      + os_managed_disk_id                                     = (known after apply)
      + patch_assessment_mode                                  = (known after apply)
      + patch_mode                                             = (known after apply)
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = (known after apply)
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "test"
      + size                                                   = "Standard_F16s"
      + tags                                                   = {
          + "Environment" = "production"
          + "Service"     = "web-app"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + id                        = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "16.04-LTS"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.static_site.module.resource_group.module.resource_group.modtm_telemetry.telemetry[0] will be updated in-place
  ~ resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
        id               = "be4ab855-c0ad-430a-91f0-32d1a4eb81db"
      + nonce            = (known after apply)
      ~ tags             = {
            "module_source"   = "registry.terraform.io/Azure/avm-res-resources-resourcegroup/azurerm"
            "module_version"  = "0.2.1"
            "random_id"       = "7b31dec0-9451-5299-79c9-895ed5c65c49"
          ~ "subscription_id" = "588aa873-b13e-40bc-a96f-89805c56d7d0" -> "1302f5fd-f3b5-4eda-909c-e3ae2dfee3d6"
            "tenant_id"       = "0b79ac7b-0cc7-4d9f-a549-3b8cc894ac9b"
        }
    }
```
</details>


*Pushed by: @joshd-emergent*